{
  "blogs": [
    {
      "title": "Apple iPhone 13 Pro Max ",
      "date": "12 Jan 2022",
      "author": "Apple.inc",
      "body": "iPhone 13 Pro Max has a 6.7-inch touchscreen display. A Hexa-Core Apple A15 processor runs iPhone 13 Pro Max. iPhone 13 Pro Max has 8GB RAM and 256GB of internal storage. iPhone 13 Pro Max has a 12MP + 12MP + 12MP+TOF Quad Rear Camera and a 12MP Dual Front camera for selfies. iPhone 13 Pro Max runs iOS 15. Buy iPhone 13 Pro Max Smartphone at the best price online from Phones & Tablets Nairobi Kenya iPhone 13 Pro Max is currently one of the latest flagship smartphones in the market. Although iPhone 13 Pro Max is almost the same as the iPhone 13 Pro, the Triple Rear Camera and the RAM make it a better choice. Unlike the iPhone 13, this phone has a bigger battery and will serve you more before you charge it again. With iPhone 13 Pro Max, you get a better version of the iPhone 13 Pro with a bigger battery, Quad rear camera, larger storage options, and great performance in General.",
      "id": 1
    },
    {
      "id": 2,
      "title": "Samsung Galaxy Note 22 ultra",
      "author": "Samsung Electronics",
      "date": "5th Jan 2022",
      "body": "Samsung was expected to discontinue the Galaxy Note lineup but as things stand, that’s not the case. The legacy phablet device now enters its 22nd generation, which also has an Ultra model. The latest Galaxy Note premium phone gets a 6.9-inch AMOLED display that supports 2K resolution at 1440x3088 pixels. The screen features a punch hole design and offers pixel density of 494 PPI. Galaxy Note 22 Ultra uses the latest flagship octa-core Exynos 9 Octa 990 chipset along with 12GB RAM to deliver high-end performance. The device comes with 128GB internal storage which is further expandable. For imaging purpose, this phone has a triple rear camera that includes 108MP primary sensor, 12MP ultra-wide-angle sensor, and 12MP telephoto sensor. On the front, the phone has a 10MP selfie camera that also supports video calls. Galaxy Note 22 Ultra gets backed up with a 5100mAh battery that supports 25W fast charging via USB Type C port. Other features on the phone include on-screen fingerprint sensor, face unlock, S Pen support and the Type C interface is for music streaming. Other premium Samsung mobiles you can buy include Samsung Galaxy S20 FE, Samsung Galaxy S21 Ultra and the Samsung Galaxy S21."
    },
    {
      "id": 3,
      "title": "Oppo Reno 7 Pro 5G",
      "author": "Oppo Mobile Telecommunications Corp., Ltd.",
      "date": "24th July 2022 ",
      "body": "The Oppo Reno 7 Pro 5G price in Kenya is around Ksh 58,920. The Reno 7 5G comes with a 6.55-inch touchscreen display with a resolution of 1080 x 2400 pixels and an aspect ratio of 20:9. It is powered by the MediaTek Dimensity 1200 Max 5G processor and runs Android 11  powered by a 4500mAh non-removable battery. It has an AMOLED screen of 90Hz refresh rate and an under-display fingerprint scanner across the board.\nIn the box you will be treated to a Silicon case, a type A to type C charging cable, and a 65W supercharger. The device comes in a few main color variants. You can pick it in Starlight Black, Startrails Blue, Gold, or League of Legends. But the two main colors are Starlight Black and Startrails Blue.\nThe Oppo Reno 7 Pro 5G looks absolutely phenomenal from all different angles because its backplate uses new LDI technology. An industry-first that uses 20 micro-sized fine textures, which gather up 1.2 micro rosters itched together. Here also is, we have OPPO’s signature glow, which uses micro-crystals to give it a shimmery and gradient finish. Once you pop the device on charge, you will notice an orbit breathing light that wraps around the camera module at the back. Some of its use cases are when receiving a call, a notification, or during charging."
    },
    {
      "title": "Three Feet From Gold",
      "author": "Napoleon Hill",
      "date": "01 August 2022",
      "body": "One of the most common cases of failure is the habit of quitting when one is overtaken by temporary defeat. Every person is guilty of this mistake at one time or another.\nAn uncle of R. U. Darby was caught by the \"gold fever\" in the gold-rush days, and went west DIG AND GROW RICH.  He had had never heard that more gold had been mined from the brains of men than has ever been taken from the earth. He staked a claim and went to work with pick and shovel. The going was hard, but his lust for gold was definite.\nAfter weeks of labor, he was rewarded by the discovery of the shining ore. He needed machinery to bring the ore to the surface. quietly, he covered up the mine, retraced his footsteps to his home in Williamsburg, Maryland, told his relatives and few neighbors of the \"strike.\" They got together money for the needed machinery, had it shipped. Th uncle and Darby went back to work the mine.\nThe first car of ore was mined, and shipped to a smelter. The returns proved they had one of the riches mines in Colorado! A few more cars of the ore would clear the debts. Then would come the big killing in profits.\nDown went the drills! Up went the hopes of Darby and Uncle! Then something happened! The vein of gold ore disappeared! They had come to the end of the rainbow, and the pot of gold was no longer there! They drilled on, desperately trying to pick up the vein again-all to no avail.\nFinally, they decided to QUIT.\nThey sold the machinery to a junk man for a few hundred dollars, and took the train back home. Some \"junk\" men are dumb, but not this one! He called in a mining engineer to look at the mine and do a little calculating. The engineer advised that the project had failed, because the owners were not familiar with \"fault line.\" His calculations showed that the vein would be found JUST THREE FEET FROM WHERE THE DARBYS HAD STOPPED DRILLING! That exactly where it was found!\nThe Junk man took millions of dollars in ore from the mine, because he knew enough to seek expert counsel before giving up.\nBefore success comes in any man's life, he is sure to meet with much temporary defeat, and, perhaps, some failure. When defeat overtakes a man, the easiest and most logical thing to do is to QUIT. That is exactly what the majority of men do.\nMore than five hundred of the most successful men this country has ever known, told the author their greatest success came just one step beyond the point at which defeat had overtaken them. Failure is a trickster with a keen sense of irony and cunning. It takes great delight in tripping one when success is almost within reach.",
      "id": 4
    },
    {
      "title": "The Rich Don't Work for Money",
      "author": "Robert Kiyosaki",
      "date": "05 August 2022",
      "body": "I didn’t tell my poor dad I wasn’t being paid. He wouldn’t have\nunderstood, and I didn’t want to try to explain something I didn’t\nunderstand myself.\nFor three more weeks, Mike and I worked three hours every\nSaturday for nothing. The work didn’t bother me, and the routine\ngot easier, but it was the missed baseball games and not being able\nto afford to buy a few comic books that got to me.\nRich dad stopped by at noon on the third week. We heard his\ntruck pull up in the parking lot and sputter when the engine was\nturned off. He entered the store and greeted Mrs. Martin with a hug.\nAfter finding out how things were going in the store, he reached into\nthe ice-cream freezer, pulled out two bars, paid for them, and signaled\nto Mike and me.\n“Let’s go for a walk, boys.”\nWe crossed the street, dodging a few cars, and walked across a\nlarge grassy field where a few adults were playing softball. Sitting\ndown at a lone picnic table, he handed Mike and me the treats.\n“How’s it going, boys?”\n“Okay,” Mike said.\nI nodded in agreement.\n“Learn anything yet?” rich dad asked.\nMike and I looked at each other, shrugged our shoulders, and\nshook our heads in unison.\n“Well, you boys had better start thinking. You’re staring at one of\nlife’s biggest lessons. If you learn it, you’ll enjoy a life of great freedom and security. If you don’t, you’ll wind up like Mrs. Martin and most of\nthe people playing softball in this park. They work very hard for little\nmoney, clinging to the illusion of job security and looking forward to a\nthree-week vacation each year and maybe a skimpy pension after forty five\nyears of service. If that excites you, I’ll give you a raise to 25 cents\nan hour.”\n“But these are good hardworking people. Are you making fun of\nthem?” I demanded.\nA smile came over rich dad’s face.\n“Mrs. Martin is like a mother to me. I would never be that cruel.\nI may sound unkind because I’m doing my best to point something out\nto the two of you. I want to expand your point of view so you can see\nsomething most people never have the benefit of seeing because their\nvision is too narrow. Most people never see the trap they are in.”\nMike and I sat there, uncertain of his message. He sounded cruel,\nyet we could sense he was trying to drive home a point.\nWith a smile, rich dad said, “Doesn’t that 25 cents an hour sound\ngood? Doesn’t it make your heart beat a little faster?”\nI shook my head no, but it really did. Twenty-five cents an hour\nwould be big bucks to me.\n“Okay, I’ll pay you a dollar an hour,” rich dad said, with a sly grin.\nNow my heart started to race. My brain was screaming, “Take it.\nTake it.” I could not believe what I was hearing. Still, I said nothing.\n“Okay, two dollars an hour.”\nMy little brain and heart nearly exploded. After all, it was 1956\nand being paid $2 an hour would have made me the richest kid in\nthe world. I couldn’t imagine earning that kind of money. I wanted to\nsay yes. I wanted the deal. I could picture a new bicycle, new baseball\nglove, and the adoration of my friends when I flashed some cash.\nOn top of that, Jimmy and his rich friends could never call me poor\nagain. But somehow my mouth stayed shut.\nThe ice cream had melted and was running down my hand. Rich\ndad was looking at two boys staring back at him, eyes wide open and\nbrains empty. He was testing us, and he knew there was a part of our emotions that wanted to take the deal. He understood that every\nperson has a weak and needy part of their soul that can be bought,\nand he knew that every individual also had a part of their soul that was\nresilient and could never be bought. It was only a question of which\none was stronger. “Okay, five dollars an hour.”\nSuddenly I was silent. Something had changed. The offer was too\nbig and ridiculous. Not many grown-ups in 1956 made more than\nthat, but quickly my temptation disappeared, and calm set in. Slowly,\nI turned to my left to look at Mike. He looked back at me. The part of my soul that was weak and needy was silenced. The part of me that\nhad no price took over. I knew Mike\nhad gotten to that point too.\n“Good,” rich dad said softly. “Most\npeople have a price. And they have a\nprice because of human emotions named\nfear and greed. First, the fear of being\nwithout money motivates us to work hard, and then once we get that\npaycheck, greed or desire starts us thinking about all the wonderful\nthings money can buy. The pattern is then set.” “What pattern?” I asked.\n“The pattern of get up, go to work, pay bills; get up, go to work,\npay bills. People’s lives are forever controlled by two emotions: fear\nand greed. Offer them more money and they continue the cycle by\nincreasing their spending. This is what I call the Rat Race.” “I doubt it,” said rich dad. “Instead, they feel the fear of not\nhaving money. They don’t confront it logically. They react emotionally\ninstead of using their heads,” rich dad said. “Then, they get a few\nbucks in their hands and again, the emotions of joy, desire, and greed\ntake over. And again they react, instead of think.”\n“So their emotions control their brain,” Mike said.\n“That’s correct,” said rich dad. “Instead of admitting the truth\nabout how they feel, they react to their feelings and fail to think.\nThey feel the fear so they go to work, hoping that money will soothe\nthe fear, but it doesn’t. It continues to haunt them and they return\nto work, hoping again that money will calm their fears, and again it\ndoesn’t. Fear keeps them in this trap of working, earning money,\nworking, earning money, hoping the fear will go away. But every day\nthey get up, and that old fear wakes up with them. For millions of\npeople that old fear keeps them awake all night, causing a night of\nturmoil and worry. So they get up and go to work, hoping that a\npaycheck will kill that fear gnawing at their soul. Money is running\ntheir lives, and they refuse to tell the truth about that. Money is in\ncontrol of their emotions and their souls.” “I’ve been a little cruel today,” said rich dad. “But I want you to\nalways remember this talk. I want you to always think of Mrs. Martin.\nAnd I want you always to remember that donkey. Never forget that\nfear and desire can lead you into life’s biggest trap if you’re not aware of\nthem controlling your thinking. To spend your life living in fear, never\nexploring your dreams, is cruel. To work hard for money, thinking that\nit will buy you things that will make you happy is also cruel. To wake up\nin the middle of the night terrified about paying bills is a horrible way to\nlive. To live a life dictated by the size of a paycheck is not really living a\nlife. Thinking that a job makes you secure is lying to yourself. That’s cruel,\nand that’s the trap I want you to avoid. I’ve seen how money runs people’s\nlives. Don’t let that happen to you. Please don’t let money run your life.”",
      "id": 5
    }
  ]
}